# LayerElemTopConstraint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..LayerElemTopConstraint Property
ParameterTypeId Class See Also
---
"Top Constraint"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId LayerElemTopConstraint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LayerElemTopConstraint As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LayerElemTopConstraint {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace